{"config": {"layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "name": "input_2", "batch_input_shape": [null, null], "sparse": false}, "name": "input_2", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"input_dim": 14558, "embeddings_constraint": null, "embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "name": "embedding_1", "output_dim": 50, "mask_zero": true, "embeddings_regularizer": null, "dtype": "float32", "trainable": true, "input_length": null, "batch_input_shape": [null, null], "activity_regularizer": null}, "name": "embedding_1", "class_name": "Embedding"}, {"inbound_nodes": [], "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 50], "sparse": false}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["embedding_1", 0, 0, {}], ["input_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "go_backwards": false, "bias_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "recurrent_constraint": null, "return_sequences": true, "name": "gru_1", "unroll": false, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "implementation": 1, "reset_after": false, "units": 50, "use_bias": true, "return_state": false, "trainable": true, "recurrent_dropout": 0.0, "bias_constraint": null, "dropout": 0.0}, "name": "gru_1", "class_name": "GRU"}, {"inbound_nodes": [[["gru_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "go_backwards": false, "bias_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "recurrent_constraint": null, "return_sequences": true, "name": "gru_2", "unroll": false, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "implementation": 1, "reset_after": false, "units": 50, "use_bias": true, "return_state": true, "trainable": true, "recurrent_dropout": 0.0, "bias_constraint": null, "dropout": 0.0}, "name": "gru_2", "class_name": "GRU"}, {"inbound_nodes": [[["gru_2", 0, 0, {}]]], "config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "softmax", "units": 14558, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "bias_constraint": null, "name": "dense_1", "activity_regularizer": null}, "name": "dense_1", "class_name": "Dense"}], "output_layers": [["dense_1", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "name": "model_1"}, "keras_version": "2.2.4", "class_name": "Model", "backend": "tensorflow"}